 doedit "C:\Users\Alan\Dropbox\CEM\CODE\2_analysis.do" 

. do "C:\Users\Alan\Dropbox\CEM\CODE\2_analysis.do"

. /*==================================================
> Name:           2_analysis.do
> 
> Project:        Coarsened Exact Matching (CEM)
>                 Outcome: valor_avaluo
> Author:         
> E-email:        
> 
> ----------------------------------------------------
> Creation Date:  02 Feb 2026
> Output:         
> ==================================================*/
. 
. /*==================================================
>               0: Program set up
> ==================================================*/
. 
. clear all

. set more off

. 
. ** Path
. global dir_0 "C:\Users\Alan\Dropbox\CEM\\"

. 
. ** Data
. global dir_data "${dir_0}DATA\\"

. 
. ** Paquetes 
. ** ssc install cem
. 
. /*==================================================
>       1: Importar datos 
> ==================================================*/
. 
. ** Importar los datos 
. use "${dir_data}predios", clear

. 
. ** Dejar solo el periodo antes del tratamiento 
. keep if year==2018 
(25,374,657 observations deleted)

. 
. ** Eliminar la variable de aÃ±o 
. drop year

. 
. /*==================================================
>       3: Arreglar las variables que son 
>                  base del matching
> ==================================================*/
. 
. /* Crear variables dummy a partir del destino 
>    del inmueble */
. 
. ** Residencial 
. gen dest_residencial = (descripcion_destino=="RESIDENCIAL")

. 
. ** Comercial
. #d;
delimiter now ;
.         gen dest_comercial = inlist(descripcion_destino,
>                 "COMERCIO EN CORREDOR COM",
>                 "COMERCIO PUNTUAL",
>                 "COMERCIO EN CENTRO COMER",
>                 "PARQUEADEROS");

. #d cr
delimiter now cr
. 
. ** Industrial
. #d;
delimiter now ;
.         gen dest_industrial = inlist(descripcion_destino,
>                 "INDUSTRIAL",
>                 "MINERO");

. #d cr
delimiter now cr
. 
. ** Agricola / rural
. #d;
delimiter now ;
.         gen dest_agricola = inlist(descripcion_destino,
>                 "AGRICOLA",
>                 "AGROPECUARIO",
>                 "PECUARIO",
>                 "AGROINDUSTRIAL",
>                 "FORESTAL",
>                 "PREDIO RURAL PARCEL. NO EDIFI.");

. #d cr
delimiter now cr
. 
. ** Otros (todo lo que no cae en las categorias anteriores)
. #d;
delimiter now ;
.       gen dest_otros = (dest_residencial==0 & 
>                         dest_comercial==0 & 
>                         dest_industrial==0 & 
>                         dest_agricola==0);

. #d cr 
delimiter now cr
. 
. /*==================================================
>       4: Coarsened Exact Matching (CEM)
> ==================================================*/
. 
. ** Realizar el CEM y crear los pesos
. #d;
delimiter now ;
.         cem area_terreno codigo_estrato (0 1.5 2.5 3.5 4.5 5.5 6.5)
>         area_construida max_num_piso 
>         dest_residencial dest_comercial 
>         dest_industrial dest_agricola dest_otros, treatment(treatment);

Matching Summary:
-----------------
Number of strata: 117
Number of matched strata: 54

                 0        1
      All  1985774   321013
  Matched  1962556   319370
Unmatched    23218     1643


Multivariate L1 distance: .27550669

Univariate imbalance:

                        L1      mean       min       25%       50%       75%       max
    area_terreno    .00647   -124.16         0     -4.03     -2.85       5.9  -4.0e+05
  codigo_estrato   6.5e-07   6.5e-07         0         0         0         0         0
 area_construida    .08631    7.0179         0       3.1     -1.39      14.7         .
    max_num_piso    .11817    .12158         0         0         0         1         .
dest_residencial   1.3e-12   5.9e-13         0         0         0         0         0
  dest_comercial   1.5e-12  -1.7e-12         0         0         0         0         0
 dest_industrial   2.2e-14  -5.7e-15         0         0         0         0         0
   dest_agricola   2.5e-14  -5.3e-17         0         0         0         0         0
      dest_otros   6.7e-13  -1.9e-13         0         0         0         0         0

. #d cr
delimiter now cr
. 
. ** Inspeccionar las observaciones con match
. tab treatment cem_matched

           |      cem_matched
 treatment |         0          1 |     Total
-----------+----------------------+----------
         0 |    23,218  1,962,556 | 1,985,774 
         1 |     1,643    319,370 |   321,013 
-----------+----------------------+----------
     Total |    24,861  2,281,926 | 2,306,787 

. 
. ** Dejar solo las observaciones con match 
. drop if cem_matched==0
(24,861 observations deleted)

. 
. ** Dejar solo las variables relevantes para el match 
. #d; 
delimiter now ;
.         keep codigo_lote cem_weights cem_matched 
>                  cem_strata codigo_construccion codigo_resto;

. #d cr 
delimiter now cr
. 
. ** Guardar la base con los pesos
. save "${dir_data}treat_weights.dta", replace
file C:\Users\Alan\Dropbox\CEM\\DATA\\treat_weights.dta saved
